out/note/economics/financial-market.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/economics/financial-market.org</title>
</head>
<body>
<pre style="white-space: pre-wrap;">#+title: financial market

* financial market

*** links

    - <a href="https://www.youtube.com/watch?v=6OoMQiClXCs">https://www.youtube.com/watch?v=6OoMQiClXCs</a>
      An introduction to financial markets
      -- MoneyWeek Investment Tutorials

    - <a href="https://www.investopedia.com/walkthrough/corporate-finance/1/financial-markets.aspx">https://www.investopedia.com/walkthrough/corporate-finance/1/financial-markets.aspx</a>

*** intro

    - investors &lt;-[return]- financial market &lt;-[cost]- borrowers

    - borrowers can be governments and companies

    - financial market can be investment banks

*** money market -- short term

*** capital market -- long term

    - equity
      - shares
        bring in new owners
        and give out dividends

    - debts
      - bonds
        tradable debts

* stock valuation

*** &gt;&lt; // 集合競價原則

    - 委買隊列 : (* &lt;price&gt;, &lt;number&gt;) &lt;ordered-list&gt;
    - 委賣隊列 : (* &lt;price&gt;, &lt;number&gt;) &lt;ordered-list&gt;
    - 開盤價 : &lt;price&gt;
    - 成交價 : (* &lt;price&gt;, &lt;number&gt;)

* terms

*** &lt;alpha&gt;

    - [define-1]
      an alpha is a mathematical, predictive model
      of the performance of financial instruments.

    - [question]
      what are the presumptions of the concept of alpha?

    - [question]
      by alpha, we are not predicting the exact &lt;price&gt; of a instrument,
      so, what are predicting?

    - [question]
      what is the type of alpha?
      by [define-1], an alpha is a function of type :
      (-&gt; &lt;instrument-data&gt; -- &lt;prediction&gt;)
      - in the most simple case &lt;prediction&gt; is simply a real number

      - there is a sense of time,
        &lt;instrument-data&gt; is accumulating
        it might include the &lt;prediction&gt;
        of the previous calculation [or be calculated again]
        - x -
          the type above does not express the sense of time.

*** &lt;statistic&gt;

***** pnl -- profit-and-loss

      #+begin_src python
      daily_pnl(instrument_list) = sum for instrument in instrument_list: (position * daily_return(instrument))
      daily_return(instrument) = (today_s_close(instrument) / yesterday_s_close(instrument)) - 1
      # yesterday_s_close == today_s_open?
      #   what can a stock exchange company do to the stocks
      #   during yesterday_s_close and today_s_open?
      #+end_src

***** active return

      - return relative to a benchmark.
        if a portfolio&apos;s return is 5%,
        and the benchmark&apos;s return is 3%,
        then the portfolio&apos;s active return is 2%.

      - the segment of the returns in an investment portfolio
        that is due to active management decisions made by the portfolio manager.
        It does not include any return that is merely a function of the market&apos;s movement.

      - the active return is calculated as
        the return of the portfolio minus some benchmark return.

***** active risk -- tracking error

      - a measure of the risk in an investment portfolio
        that is due to active management decisions made by the portfolio manager;
        it indicates how closely a portfolio follows the index
        to which it is benchmarked.

      - The best measure is the standard deviation
        of the difference between the portfolio and index returns.

***** IR -- information ratio -- appraisal ratio

      - prediction ability of a model

      - mean(daily_pnl) is the *expected value* of daily_pnl *over time*
        - i.e. the long-run average value
          of repetitions of the experiment it represents.                                                                                                                                                                                                                                                        - the expected value is also known as
            the expectation,
            mathematical expectation,
            EV,
            average,
            mean value,
            mean,
            first moment.

      #+begin_src python
      information_ratio = mean(daily_pnl) / standard_deviation(daily_pnl)
      #+end_src

      - Sharpe ratio is the annual IR: IR * sqrt(252)
        - the 252 represents the estimated number of trading days in a year

***** turnover

      - value traded / value held

***** drawdown

      - percentage of the largest loss

***** volume -- measuring stock activity

      - the number of shares or contracts
        traded in a security or an entire market
        during a given period of time.

      - For example:
        - Trader 1 Buys 100 shares of stock
        - Trader 2 Buy 500 shares of stock
        - Trader 3 Sells 1000 shares of stock
        Total volume is then 1,600 shares for this sequence.
        volume increases regardless if it is a buy or sell order.

*** &gt;&lt; to generate trading strategy from alpha

*** &gt;&lt; &lt;market-data&gt; &amp; &lt;instrument-data&gt;
</pre>
</body>
</html>
